## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/11012650397)



<pre><code>Plan: 7 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator
  * module.signify_secret_rotator.google_cloud_run_service_iam_member.signify_secret_rotator_invoker
  * module.signify_secret_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer
  * module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_accessor
  * module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_adder
  * module.signify_secret_rotator.google_pubsub_subscription.signify_secret_rotator
  * module.signify_secret_rotator.google_service_account.signify_secret_rotator
* Update
  * google_service_account.sa-gke-kyma-integration
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_service_account.sa-gke-kyma-integration will be updated in-place
  ~ resource "google_service_account" "sa-gke-kyma-integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE." -> "Service account is used by Prow to integrate with GKE. Will be removed with Prow"
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator will be created
  + resource "google_cloud_run_service" "signify_secret_rotator" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west4"
      + name                       = "signify-secret-rotator"
      + project                    = "sap-kyma-prow"
      + status                     = (known after apply)

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/signify-secret-rotator:v20240924-997e8b7b"
                  + name  = (known after apply)

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-rotator"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "signify-secret-rotator"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                }
            }
        }
    }

  # module.signify_secret_rotator.google_cloud_run_service_iam_member.signify_secret_rotator_invoker will be created
  + resource "google_cloud_run_service_iam_member" "signify_secret_rotator_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west4"
      + member   = "serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
      + project  = "sap-kyma-prow"
      + role     = "roles/run.invoker"
      + service  = "signify-secret-rotator"
    }

  # module.signify_secret_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer will be created
  + resource "google_project_iam_member" "service_account_keys_rotator_secret_version_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/secretmanager.viewer"
    }

  # module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_accessor will be created
  + resource "google_project_iam_member" "signify_secret_rotator_secret_version_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_adder will be created
  + resource "google_project_iam_member" "signify_secret_rotator_secret_version_adder" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/secretmanager.secretVersionAdder"
    }

  # module.signify_secret_rotator.google_pubsub_subscription.signify_secret_rotator will be created
  + resource "google_pubsub_subscription" "signify_secret_rotator" {
      + ack_deadline_seconds       = 20
      + effective_labels           = {
          + "application_name"           = "secrets-rotator"
          + "goog-terraform-provisioned" = "true"
        }
      + filter                     = "attributes.eventType = \"SECRET_ROTATE\""
      + id                         = (known after apply)
      + labels                     = {
          + "application_name" = "secrets-rotator"
        }
      + message_retention_duration = "604800s"
      + name                       = "secrets-rotator-signify-secret-rotator"
      + project                    = "sap-kyma-prow"
      + terraform_labels           = {
          + "application_name"           = "secrets-rotator"
          + "goog-terraform-provisioned" = "true"
        }
      + topic                      = "secret-manager-notifications"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/sap-kyma-prow/topics/secrets-rotator-dead-letter"
          + max_delivery_attempts = 15
        }

      + expiration_policy {
          + ttl = "31556952s"
        }

      + push_config {
          + push_endpoint = (known after apply)

          + oidc_token {
              + service_account_email = "secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            }
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.signify_secret_rotator.google_service_account.signify_secret_rotator will be created
  + resource "google_service_account" "signify_secret_rotator" {
      + account_id  = "signify-rotator"
      + description = "Identity of the signify secret rotator service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = "sap-kyma-prow"
      + unique_id   = (known after apply)
    }

Plan: 7 to add, 2 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11960,"Program":"tfcmt","SHA1":"6eec3fa97dca69c378cab88ab7a11a590697e744","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->